## Pandas Examples

In [1]:
import numpy as np
import pandas as pd

In [2]:
my_data = np.array([[0,3],[10,7], [30,14],[40,15],[20,9]])

my_columns = ['temperature', 'activity']

my_dataframe = pd.DataFrame(data=my_data, columns=my_columns)

print(my_dataframe)

   temperature  activity
0            0         3
1           10         7
2           30        14
3           40        15
4           20         9

In [3]:
my_dataframe['activity']

0     3
1     7
2    14
3    15
4     9
Name: activity, dtype: int32

In [4]:
print(my_dataframe['activity'])

0     3
1     7
2    14
3    15
4     9
Name: activity, dtype: int32

In [5]:
my_dataframe['adjusted'] = my_dataframe['activity'] + 2

In [6]:
print(my_dataframe)

   temperature  activity  adjusted
0            0         3         5
1           10         7         9
2           30        14        16
3           40        15        17
4           20         9        11

In [7]:
my_dataframe.head(3)

   temperature  activity  adjusted
0            0         3         5
1           10         7         9
2           30        14        16

In [8]:
my_dataframe[1:4]

   temperature  activity  adjusted
1           10         7         9
2           30        14        16
3           40        15        17

In [9]:
my_dataframe.iloc[[2]]

   temperature  activity  adjusted
2           30        14        16

In [12]:
new_columns = ['Eleanor', 'chidi', 'Tahani', 'Jason']

new_data = np.random.randint(low=0, high=101, size=(3,4))

In [13]:
new_dataframe = pd.DataFrame(data=new_data, columns=new_columns)

In [14]:
print(new_dataframe)

   Eleanor  chidi  Tahani  Jason
0       45      0      63      1
1        8     35      45     54
2       43      8      36     34

In [15]:
print(new_dataframe)

   Eleanor  chidi  Tahani  Jason
0       45      0      63      1
1        8     35      45     54
2       43      8      36     34

In [17]:
new_dataframe.iloc[[1]]['Eleanor']

1    8
Name: Eleanor, dtype: int32

In [18]:
new_dataframe['Janet'] = new_dataframe['Tahani'] + new_dataframe['Jason']

In [19]:
print(new_dataframe)

   Eleanor  chidi  Tahani  Jason  Janet
0       45      0      63      1     64
1        8     35      45     54     99
2       43      8      36     34     70

In [20]:
new_dataframe['Eleanor'][1]

8